In [1]:
import pandas as pd

C:\Users\taeeu\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\taeeu\anaconda3\lib\site-packages\numpy\.libs\libopenblas.el2c6ple4zyw3eceviv3oxxgrn2nrfm2.gfortran-win_amd64.dll
C:\Users\taeeu\anaconda3\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

In [2]:
students=pd.DataFrame({'이름':['장화', '홍련', '콩쥐', '팥쥐', '해님', '달님'], '국어':[70, 85,None, 100, None, 85], '수학':[65, 100, 80, 95, None, 70]})

In [3]:
students

   이름     국어     수학
0  장화   70.0   65.0
1  홍련   85.0  100.0
2  콩쥐    NaN   80.0
3  팥쥐  100.0   95.0
4  해님    NaN    NaN
5  달님   85.0   70.0

In [4]:
students[(students['국어']>=80)&(students['수학']>=80)]

   이름     국어     수학
1  홍련   85.0  100.0
3  팥쥐  100.0   95.0

### 1. row 추가

In [5]:
#데이터프레임 생성
score=pd.DataFrame({'국어':[100, 80], '수학':[75, 90], '영어':[90, 95]}, index=['장화', '홍련'])
score

#데이터프레임에 계산 가능
score.loc['홍련', '영어']=100
score['국어']=score['국어']-5
score

    국어  수학   영어
장화  95  75   90
홍련  75  90  100

In [6]:
new_students=pd.DataFrame({'국어':[70,85], '수학':[65, 100], '영어':[95, 65]}, index=['콩쥐', '팥쥐'])
new_students

    국어   수학  영어
콩쥐  70   65  95
팥쥐  85  100  65

### append 함수로 행 추가

In [7]:
score=score.append(new_students)
score

    국어   수학   영어
장화  95   75   90
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65

In [8]:
new_students1=pd.Series({'국어':85, '수학':55, '영어':95}, name='해님')
score=score.append(new_students1)
score

    국어   수학   영어
장화  95   75   90
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65
해님  85   55   95

### 2. column 추가

In [9]:
science=[80,70,90,85,75]
score['과학']=science
score['학년']=1
score

    국어   수학   영어  과학  학년
장화  95   75   90  80   1
홍련  75   90  100  70   1
콩쥐  70   65   95  90   1
팥쥐  85  100   65  85   1
해님  85   55   95  75   1

In [10]:
score['과학']=score['과학']+5
score['총점']=score['국어']+score['수학']+score['영어']+score['과학']
score

    국어   수학   영어  과학  학년   총점
장화  95   75   90  85   1  345
홍련  75   90  100  75   1  340
콩쥐  70   65   95  95   1  325
팥쥐  85  100   65  90   1  340
해님  85   55   95  80   1  315

### 3. row/column 삭제

In [11]:
score.drop('장화', inplace=True)

In [12]:
score

    국어   수학   영어  과학  학년   총점
홍련  75   90  100  75   1  340
콩쥐  70   65   95  95   1  325
팥쥐  85  100   65  90   1  340
해님  85   55   95  80   1  315

In [13]:
score.drop(columns=['과학', '학년', '총점'],inplace=True)
score

    국어   수학   영어
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65
해님  85   55   95